tutorials/immersedBoundary/movingCylinderInChannelIcoFine/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    ibCylinder
    {
        type movingImmersedBoundaryVelocity;
        patchType immersedBoundary;
        setDeadValue   yes;
        deadValue      (0 0 0);
        value uniform (0 0 0);
    }
    in
    {
        type fixedValue;
        value uniform (1 0 0);
    }
    out
    {
        type inletOutlet;
        inletValue uniform (0 0 0);
        value uniform (1 0 0);
    }
    top
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    bottom
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    frontAndBack
    {
        type empty;
    }
}

// ************************************************************************* //
